orgs/2024-03-01-org-babel-switches.org
#+TITLE: 浅析 org babel switches
#+DATE: 2024-03-01

#+begin_abstract
本文以分析函数 ~org-element-src-block-parser~ 为例，简要介绍了 Org-mode 代码块中
=switches= 的作用和用法。
#+end_abstract
* 什么是 =switches= ?
=switches= 是 =#+BEGIN_SRC= [fn:1] 一栏上的可选参数，其具体的位置如下：
#+begin_example
  ,#+BEGIN_SRC <language> <switches> <header arguments>
    <body>
  ,#+END_SRC
#+end_example
它的作用是提供更精细的代码导出控制[fn:2] 。Org Manual 在 [[https://orgmode.org/manual/Literal-Examples.html][Literal Examples]] 一节介
绍几个 =switch= 及其用法，这里做个简单的总结：
- -n :: 在导出时给代码块添加行号。默认第一行的行号是 1 ，如果提供一个数字 a（如
  =-n 10=），则第一行的行号是 a 。
- +n :: 在导出时给代码块添加行号。但与 =-n= 不同的是，它是从上一个有行号的代码块的
  结束行开始计数，比如说上一个代码块的结束行号是 10 ，那么当前代码块就从 11 开始
  计数。=+n= 同样也接受一个可选的数字参数，作用与 =-n= 类似。
- -l :: 为当前代码块设置 =org-coderef-label-format= 。
- -r :: 导出时移除代码块中的引用标签（coderef label）。如果和 =-n= 一起用，则会把
  引用标签移到行号上（在 HTML 中就是设置行号所在元素的 =id= 属性）。
- -i :: 导出时不修改代码块中的缩进。
- -k :: 导出时保留代码块中的引用标签（coderef label）。
