articles/2024-03-01-org-babel-switches.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-03-09 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>浅析 org babel switches</title>
<meta name="author" content="Eli Qian" />
<meta name="generator" content="Org Mode" />
<link rel="icon" href="/static/favion.png">
<link rel="stylesheet" type="text/css" href="/css/styles.css"/>
<link rel="stylesheet" type="text/css" href="/css/htmlize.css" />
<link href='https://unpkg.com/boxicons@2.1.4/css/boxicons.min.css' rel='stylesheet'>
</head>
<body>
<div id="preamble" class="status">
<nav class="nav">
  <a href="/index.html" class="button">Home</a>
  <a href="/config.html" class="button">Literate Emacs Config</a>
  <a href="/rss.xml" class="button">RSS</a>
</nav>
<hr>
</div>
<div id="content" class="content">
<header>
<h1 class="title">浅析 org babel switches</h1>
</header><div class="post-status"><span><i class='bx bx-calendar'></i>
<span>2024-03-01</span></span>
<span><i class='bx bx-edit'></i><span>2024-03-01</span></span><span><i class='bx bx-history'></i><span><a href="https://github.com/Elilif/Elilif.github.io/commits/master/orgs/2024-03-01-org-babel-switches.org">history</a></span></span></div><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#什么是-=switches=-?">1. 什么是 <code>switches</code> ?</a></li>
<li><a href="#使用分享">2. 使用分享</a></li>
<li><a href="#总结">3. 总结</a></li>
</ul>
</div>
</nav>
<div class="abstract">
<p>
本文以分析函数 <code>org-element-src-block-parser</code> 为例，简要介绍了 Org-mode 代码块中
<code>switches</code> 的作用和用法。
</p>

</div>
<div id="outline-container-什么是-=switches=-?" class="outline-2">
<h2 id="什么是-=switches=-?"><span class="section-number-2">1.</span> 什么是 <code>switches</code> ?</h2>
<div class="outline-text-2" id="text-什么是-=switches=-?">
<p>
<code>switches</code> 是 <code>#+BEGIN_SRC</code> <sup><label for="fnr.1" class="footref">1</label></sup><input id="fnr.1" class="footref-toggle" type="checkbox"> 一栏上的可选参数，其具体的位置如下：
</p>
<pre class="example">
#+BEGIN_SRC &lt;language&gt; &lt;switches&gt; &lt;header arguments&gt;
  &lt;body&gt;
#+END_SRC
</pre>
<p>
它的作用是提供更精细的代码导出控制<sup><label for="fnr.2" class="footref">2</label></sup><input id="fnr.2" class="footref-toggle" type="checkbox"> 。Org Manual 在 <a href="https://orgmode.org/manual/Literal-Examples.html">Literal Examples</a> 一节介绍几个 <code>switch</code> 及其用法，这里做个简单的总结：
</p>
<dl class="org-dl">
<dt>-n</dt><dd>在导出时给代码块添加行号。默认第一行的行号是 1 ，如果提供一个数字 a（如
<code>-n 10</code>），则第一行的行号是 a 。</dd>
<dt>+n</dt><dd>在导出时给代码块添加行号。但与 <code>-n</code> 不同的是，它是从上一个有行号的代码块的结束行开始计数，比如说上一个代码块的结束行号是 10 ，那么当前代码块就从 11 开始计数。<code>+n</code> 同样也接受一个可选的数字参数，作用与 <code>-n</code> 类似。</dd>
<dt>-l</dt><dd>为当前代码块设置 <code>org-coderef-label-format</code> 。</dd>
<dt>-r</dt><dd>导出时移除代码块中的引用标签（coderef label）。如果和 <code>-n</code> 一起用，则会把引用标签移到行号上（在 HTML 中就是设置行号所在元素的 <code>id</code> 属性）。</dd>
<dt>-i</dt><dd>导出时不修改代码块中的缩进。</dd>
<dt>-k</dt><dd>导出时保留代码块中的引用标签（coderef label）。</dd>
</dl>
</div>
</div>
